Repository: OolaaPleur/piececalc
Catalog: lib/l10n/intl_*.arb
Languages: ru

# statsBottomNavBarTitle
source: Stats
ru: Статистика

# homeBottomNavBarTitle
source: Timeline
ru: Лента

# settingsBottomNavBarTitle
source: Settings
ru: Настройки

source: Add done work
ru: Добавить выполненную работу

source: Work amount
ru: Количество работы

# settingsChangeTheme
source: Change Theme
ru: Сменить тему

source: Add new work
ru: Добавить новую работу

source: Backup
ru: Резервная копия

source: Work name
ru: Название работы

source: Piece work
ru: Работа за единицу

source: Hour work
ru: Работа по часам

source: Price for one piece
ru: Цена за единицу

# priceForOneHour
source: Price for one hour of work
ru: Цена за один час работы

source: January
ru: {day, plural, other{Января} =0{Январь}}

source: February
ru: {day, plural, other{Февраля} =0{Февраль}}

source: March
ru: {day, plural, other{Марта} =0{Март}}

source: April
ru: {day, plural, other{Апреля} =0{Апрель}}

source: May
ru: {day, plural, other{Мая} =0{Май}}

source: June
ru: {day, plural, other{Июня} =0{Июнь}}

source: July
ru: {day, plural, other{Июля} =0{Июль}}

source: August
ru: {day, plural, other{Августа} =0{Август}}

source: September
ru: {day, plural, other{Сентября} =0{Сентябрь}}

source: October
ru: {day, plural, other{Октября} =0{Октябрь}}

source: November
ru: {day, plural, other{Ноября} =0{Ноябрь}}

source: December
ru: {day, plural, other{Декабря} =0{Декабрь}}

source: Monday
ru: Понедельник

source: Tuesday
ru: Вторник

source: Wednesday
ru: Среда

source: Thursday
ru: Четверг

source: Friday
ru: Пятница

source: Saturday
ru: Суббота

source: Sunday
ru: Воскресенье

# somethingWentWrong
source: Something went wrong. PLease try again.
ru: Что-то пошло не так. Пожалуйста, попробуйте еще раз.

source: Edit task
ru: Редактировать задачу

source: Please enter date
ru: Пожалуйста, введите дату

source: Enter Date
ru: Введите дату

source: Please enter work name
ru: Пожалуйста, введите название работы

source: Please enter valid work name
ru: Пожалуйста, введите корректное название работы

source: Please enter an amount
ru: Пожалуйста, введите количество

source: Please enter a valid number
ru: Пожалуйста, введите корректное число

# deleteTask
source: Delete
ru: Удалить

source: Remove field
ru: Удалить поле

# noWorkHasBeenAdded
source: No work has been added. To add new work 1) Go to Settings 2) Click 'Add new work'
ru: Работы не добавлены. Чтобы добавить новую работу 1) Перейдите в Настройки 2) Нажмите 'Добавить новую работу'

source: Or press this button
ru: Или нажмите эту кнопку

# tasksNotAddedYet
source: Tasks not added yet, press plus button at the bottom right
ru: Задачи еще не добавлены, нажмите кнопку плюс внизу справа

source: Earned
ru: Цена

source: Amount
ru: Количество

# noneCurrencyPicked
source: None picked
ru: Валюта не выбрана

source: Change currency
ru: Сменить валюту

source: Work deleted
ru: Работа удалена

source: Work is already used in task. Cant Delete
ru: Работа уже используется в задаче. Удаление невозможно

source: Please enter a price
ru: Пожалуйста, введите цену

source: Save
ru: Сохранить

source: Add works in settings
ru: Добавьте работы в настройках

source: Tap to add task
ru: Нажмите, чтобы добавить задачу

source: English
ru: Английский

source: Russian
ru: Русский

source: Estonian
ru: Эстонский

source: Change language
ru: Сменить язык

# noDataForThisMonth
source: No data for this month is found
ru: Данные за этот месяц отсутствуют

source: Share month data
ru: Поделиться данными за месяц

source: Time spent
ru: Потраченное время

source: Time is not picked
ru: Время не выбрано

source: Yes
ru: Да

source: No
ru: Нет

source: Task deletion
ru: Удаление задачи

source: Would you like to delete this task?
ru: Вы хотите удалить эту задачу?

source: Work deletion
ru: Удаление работы

source: Would you like to delete this work?
ru: Вы хотите удалить эту работу?

source: Email to me!
ru: Напиши мне на почту!

source: Invalid Format
ru: Неверный формат

source: Error
ru: Ошибка

source: Select Time
ru: Выберите время

source: Add new field
ru: Добавить новое поле

# hoursOnly
source: {count, plural, =0{0 hours} =1{1 hour} other{{count} hours}}
ru: {count, plural, =0{0 часов} one{1 час} few{{count} часа} many{{count} часов} other{{count} часов}}

# minutesOnly
source: {count, plural, =0{0 minutes} =1{1 minute} other{{count} minutes}}
ru: {count, plural, =0{0 минут} one{1 минута} few{{count} минуты} many{{count} минут} other{{count} минут}}
